{"config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 64, 64, 4], "sparse": false}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"kernel_regularizer": null, "name": "conv2d_1", "padding": "valid", "trainable": true, "filters": 16, "strides": [2, 2], "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 64, 64, 4]}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "conv2d_2", "padding": "valid", "trainable": true, "filters": 32, "strides": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "conv2d_3", "padding": "valid", "trainable": true, "filters": 64, "strides": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 256, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 4, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "name": "model_1"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.6"}